{"backend": "tensorflow", "config": [{"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_regularizer": null, "batch_input_shape": [null, 200], "dtype": "float32", "activity_regularizer": null, "units": 100, "bias_constraint": null, "activation": "relu", "name": "dense_1", "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"name": "dropout_1", "trainable": true, "rate": 0.2}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "units": 50, "bias_constraint": null, "activation": "relu", "name": "dense_2", "use_bias": true, "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"name": "dropout_2", "trainable": true, "rate": 0.2}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "units": 25, "bias_constraint": null, "activation": "relu", "name": "dense_3", "use_bias": true, "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "units": 3, "bias_constraint": null, "activation": "softmax", "name": "dense_4", "use_bias": true, "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}], "keras_version": "2.0.8", "class_name": "Sequential"}